yulei/amk/sdk/lpc55/drivers/fsl_power.c
    const uint32_t PMC_DCDC0_DEFAULT = 0x010C4E68;
    const uint32_t PMC_DCDC1_DEFAULT = 0x01803A98;

    uint32_t dcdcTrimValue0;
    uint32_t dcdcTrimValue1;

    switch (dcdc_power_profile)
    {
        case DCDC_POWER_PROFILE_LOW:
            /* Low */
            dcdcTrimValue0 = (*((volatile unsigned int *)(FLASH_NMPA_DCDC_POWER_PROFILE_LOW_0_ADDRS)));
            dcdcTrimValue1 = (*((volatile unsigned int *)(FLASH_NMPA_DCDC_POWER_PROFILE_LOW_1_ADDRS)));

            if (0UL != (dcdcTrimValue0 & 0x1UL))
            {
                dcdcTrimValue0 = dcdcTrimValue0 >> 1;

                PMC->DCDC0 = dcdcTrimValue0;
                PMC->DCDC1 = dcdcTrimValue1;
#if (defined(NIOBE_DEBUG_LEVEL) && (NIOBE_DEBUG_LEVEL >= 1))
                PRINTF(
                    "\nINFO : DCDC Power Profile set to "
                    "LOW"
                    "\n");
#endif
            }
            break;

        case DCDC_POWER_PROFILE_MEDIUM:
            /* Medium */
            dcdcTrimValue0 = (*((volatile unsigned int *)(FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_0_ADDRS)));
            dcdcTrimValue1 = (*((volatile unsigned int *)(FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_1_ADDRS)));

            if (0UL != (dcdcTrimValue0 & 0x1UL))
            {
                dcdcTrimValue0 = dcdcTrimValue0 >> 1;

                PMC->DCDC0 = dcdcTrimValue0;
                PMC->DCDC1 = dcdcTrimValue1;
#if (defined(NIOBE_DEBUG_LEVEL) && (NIOBE_DEBUG_LEVEL >= 1))
                PRINTF(
                    "\nINFO : DCDC Power Profile set to "
                    "MEDIUM"
                    "\n");
#endif
            }
            break;

        case DCDC_POWER_PROFILE_HIGH:
            /* High */
            dcdcTrimValue0 = (*((volatile unsigned int *)(FLASH_NMPA_DCDC_POWER_PROFILE_HIGH_0_ADDRS)));
            dcdcTrimValue1 = (*((volatile unsigned int *)(FLASH_NMPA_DCDC_POWER_PROFILE_HIGH_1_ADDRS)));

            if (0UL != (dcdcTrimValue0 & 0x1UL))
            {
                dcdcTrimValue0 = dcdcTrimValue0 >> 1;

                PMC->DCDC0 = dcdcTrimValue0;
                PMC->DCDC1 = dcdcTrimValue1;
#if (defined(NIOBE_DEBUG_LEVEL) && (NIOBE_DEBUG_LEVEL >= 1))
                PRINTF(
                    "\nINFO : DCDC Power Profile set to "
                    "HIGH"
                    "\n");
#endif
            }
            break;

        default:
            /* Low */
            PMC->DCDC0 = PMC_DCDC0_DEFAULT;
            PMC->DCDC1 = PMC_DCDC1_DEFAULT;
#if (defined(NIOBE_DEBUG_LEVEL) && (NIOBE_DEBUG_LEVEL >= 1))
            PRINTF(
                "\nINFO : DCDC Power Profile set to "
                "LOW"
                "\n");
#endif
            break;
    }
}

/**
 * @brief
 * @param
 * @return
 */
static lowpower_process_corner_enum lowpower_get_part_process_corner(void)
{
#define FLASH_NMPA_PVT_MONITOR_0_RINGO_ADDRS (FLASH_NMPA_BASE + 0x130U)
#define FLASH_NMPA_PVT_MONITOR_1_RINGO_ADDRS (FLASH_NMPA_BASE + 0x140U)

    lowpower_process_corner_enum part_process_corner;
    uint32_t pvt_ringo_hz;
    uint32_t pvt_ringo_0 = (*((volatile unsigned int *)(FLASH_NMPA_PVT_MONITOR_0_RINGO_ADDRS)));
    uint32_t pvt_ringo_1 = (*((volatile unsigned int *)(FLASH_NMPA_PVT_MONITOR_1_RINGO_ADDRS)));

    /*
     * Check that the PVT Monitors Trimmings in flash are valid.
     */
    if (0UL != (pvt_ringo_0 & 0x1UL))
    {
        /* PVT Trimmings in Flash are valid */
        pvt_ringo_0 = pvt_ringo_0 >> 1;
    }
    else
    {
        /* PVT Trimmings in Flash are NOT valid (average value assumed) */
        pvt_ringo_0 = PROCESS_NNN_AVG_HZ;
    }

    if (0UL != (pvt_ringo_1 & 0x1UL))
    {
        /* PVT Trimmings in Flash are valid */
        pvt_ringo_1 = pvt_ringo_1 >> 1;
    }
    else
    {
        /* PVT Trimmings in Flash are NOT valid (average value assumed) */
        pvt_ringo_1 = PROCESS_NNN_AVG_HZ;
    }

    if (pvt_ringo_1 <= pvt_ringo_0)
    {
        pvt_ringo_hz = pvt_ringo_1;
    }
    else
    {
        pvt_ringo_hz = pvt_ringo_0;
    }

    /*
     * Determine the process corner based on the value of the Ring Oscillator frequency
     */
    if (pvt_ringo_hz <= PROCESS_NNN_MIN_HZ)
    {
        /* SSS Process Corner */
        part_process_corner = PROCESS_CORNER_SSS;
#if (defined(NIOBE_DEBUG_LEVEL) && (NIOBE_DEBUG_LEVEL >= 1))
        PRINTF(
            "\nINFO : Process Corner : "
            "SSS"
            "\n");
#endif
    }
    else
    {
        if (pvt_ringo_hz <= PROCESS_NNN_MAX_HZ)
        {
            /* NNN Process Corner */
            part_process_corner = PROCESS_CORNER_NNN;
#if (defined(NIOBE_DEBUG_LEVEL) && (NIOBE_DEBUG_LEVEL >= 1))
            PRINTF(
                "\nINFO : Process Corner : "
                "NNN"
                "\n");
#endif
        }
        else
        {
            /* FFF Process Corner */
            part_process_corner = PROCESS_CORNER_FFF;
#if (defined(NIOBE_DEBUG_LEVEL) && (NIOBE_DEBUG_LEVEL >= 1))
            PRINTF(
                "\nINFO : Process Corner : "
                "FFF"
                "\n");
#endif
        }
    }

    return (part_process_corner);
}

/**
 * @brief   Described in fsl_common.h
 * @param
 * @return
 */
static void lowpower_set_voltage_for_process(lowpower_dcdc_power_profile_enum dcdc_power_profile)
{
    /* Get Sample Process Corner */
    lowpower_process_corner_enum part_process_corner = lowpower_get_part_process_corner();

    switch (part_process_corner)
    {
        case PROCESS_CORNER_SSS:
            /* Slow Corner */
            {
                switch (dcdc_power_profile)
                {
                    case DCDC_POWER_PROFILE_MEDIUM:
                        /* Medium */
                        lowpower_set_system_voltage(VOLTAGE_SSS_MED_MV);
                        break;

                    case DCDC_POWER_PROFILE_HIGH:
                        /* High */
                        lowpower_set_system_voltage(VOLTAGE_SSS_HIG_MV);
                        break;

                    default:
                        /* DCDC_POWER_PROFILE_LOW */
                        lowpower_set_system_voltage(VOLTAGE_SSS_LOW_MV);
                        break;
                } // switch(dcdc_power_profile)
            }
            break;

        case PROCESS_CORNER_FFF:
            /* Fast Corner */
            {
                switch (dcdc_power_profile)
                {
                    case DCDC_POWER_PROFILE_MEDIUM:
                        /* Medium */
                        lowpower_set_system_voltage(VOLTAGE_FFF_MED_MV);
                        break;

                    case DCDC_POWER_PROFILE_HIGH:
                        /* High */
                        lowpower_set_system_voltage(VOLTAGE_FFF_HIG_MV);
                        break;

                    default:
                        /* DCDC_POWER_PROFILE_LOW */
                        lowpower_set_system_voltage(VOLTAGE_FFF_LOW_MV);
                        break;
                } // switch(dcdc_power_profile)
            }
            break;

        default:
            /* Nominal (NNN) and all others Process Corners : assume Nominal Corner */
            {
                switch (dcdc_power_profile)
                {
                    case DCDC_POWER_PROFILE_MEDIUM:
                        /* Medium */
                        lowpower_set_system_voltage(VOLTAGE_NNN_MED_MV);
                        break;

                    case DCDC_POWER_PROFILE_HIGH:
                        /* High */
                        lowpower_set_system_voltage(VOLTAGE_NNN_HIG_MV);
                        break;

                    default:
                        /* DCDC_POWER_PROFILE_LOW */
                        lowpower_set_system_voltage(VOLTAGE_NNN_LOW_MV);
                        break;
                } // switch(dcdc_power_profile)
                break;
            }
    } // switch(part_process_corner)
}

/**
 * @brief             Described in fsl_common.h
 * @param
 * @return
 */
void POWER_SetVoltageForFreq(uint32_t system_freq_hz)
{
    if (system_freq_hz <= DCDC_POWER_PROFILE_LOW_MAX_FREQ_HZ)
    {
        /* [0 Hz - DCDC_POWER_PROFILE_LOW_MAX_FREQ_HZ Hz] */
        lowpower_set_dcdc_power_profile(DCDC_POWER_PROFILE_LOW); /* DCDC VOUT = 1.05 V by default */
        lowpower_set_voltage_for_process(DCDC_POWER_PROFILE_LOW);
    }
    else
    {
        if (system_freq_hz <= DCDC_POWER_PROFILE_MEDIUM_MAX_FREQ_HZ)
        {
            /* ]DCDC_POWER_PROFILE_LOW_MAX_FREQ_HZ Hz - DCDC_POWER_PROFILE_MEDIUM_MAX_FREQ_HZ Hz] */
            lowpower_set_dcdc_power_profile(DCDC_POWER_PROFILE_MEDIUM); /* DCDC VOUT = 1.15 V by default */
            lowpower_set_voltage_for_process(DCDC_POWER_PROFILE_MEDIUM);
        }
        else
        {
            /* > DCDC_POWER_PROFILE_MEDIUM_MAX_FREQ_HZ Hz */
            lowpower_set_dcdc_power_profile(DCDC_POWER_PROFILE_HIGH); /* DCDC VOUT = 1.2 V by default */
            lowpower_set_voltage_for_process(DCDC_POWER_PROFILE_HIGH);
        }
    }
}

